zhac-project/zhac-main-core/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_SPIRAM=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y
CONFIG_FREERTOS_ISR_STACKSIZE=2096
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# Per-core CPU load telemetry (heartbeat cpu_pct_c0 / cpu_pct_c1)
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# Performance tuning. P4 is RISC-V and uses neither WiFi/lwip nor
# TLS-on-host (S3 does both), so the only meaningful knob is the
# compiler optimization level. -O2 saves ~15% on hot paths
# (zcl encode/decode, JSON build, hap_dispatch, lua bytecode interp).
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_MBEDTLS_COMPILER_OPTIMIZATION_PERF=y

# P4 buttons
CONFIG_ZHAC_P4_RESET_BTN_GPIO=35

# PSRAM placement — P4's separate flash/PSRAM buses + L2 cache make
# these essentially free. RODATA shifts const tables (ZHC catalogs,
# string literals) into PSRAM, offloading the flash MMU window and
# improving random-read latency. BSS_SEG_EXTERNAL_MEMORY enables
# EXT_RAM_BSS_ATTR for selected static scratch buffers (s_hap_tx,
# s_rsp_buf) — only safe on non-DMA, non-ISR paths.
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
